noless-zz/esp8266-led-strip-clock/src/main.cpp
/*
 * ESP8266 LED Strip Clock
 * 60-LED NeoPixel time display with NTP sync and timezone auto-detection
 * Features: WiFi captive portal, firmware OTA upload, time sync, color blending
 */

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>
#include <ESPAsyncTCP.h>
#include <DNSServer.h>
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <ESP8266mDNS.h>
#include <Adafruit_NeoPixel.h>
#include <EEPROM.h>
#include <Updater.h>
#include <time.h>
#include <sys/time.h>

#ifndef NUM_LEDS
#define NUM_LEDS 60
#endif
#ifndef LED_PIN
#define LED_PIN D4
#endif

// Build timestamp - compiler generates this automatically
const char* FW_VERSION_BASE = "2.0.0";
const char* FW_BUILD_TIME = __DATE__ " " __TIME__;
const char* AP_SSID = "LED-Clock";
const char* AP_PASS = "";
const char* OTA_PASS = "admin123";
const char* NTP_SERVER = "pool.ntp.org";
const byte DNS_PORT = 53;
const int MAX_SCAN_CACHE = 30;

// EEPROM Layout
const int EEPROM_SIZE = 512;
const int EEPROM_MAGIC_ADDR = 0;
const int EEPROM_SSID_ADDR = 1;
const int EEPROM_PASS_ADDR = 65;
const int EEPROM_BRIGHTNESS_ADDR = 129;
const int EEPROM_TZ_OFFSET_ADDR = 130;
const uint8_t EEPROM_MAGIC = 0xA7;
const int MAX_SSID_LEN = 32;
const int MAX_PASS_LEN = 64;

// Global state - LEDs
Adafruit_NeoPixel *ledStrip = nullptr;
uint8_t ledBrightness = 76;  // 30%
struct CRGB { uint8_t r, g, b; } leds[NUM_LEDS];

// Web server
AsyncWebServer server(80);
DNSServer dnsServer;
bool mdnsStarted = false;

// WiFi state
struct ScanCacheEntry {
  String ssid;
  int32_t rssi = 0;
  int channel = -1;
  int enc = -1;
  bool hasBssid = false;
};
ScanCacheEntry scanCache[MAX_SCAN_CACHE];
int scanCacheCount = 0;
unsigned long scanCacheUpdatedAt = 0;

struct {
  bool active = false;
  bool connecting = false;
  bool success = false;
  String attemptedSsid;
  String error = "";
  unsigned long startedAt = 0;
  wl_status_t lastStatus = WL_DISCONNECTED;
} wifiConnect;

bool wifiConnected = false;
unsigned long lastNtpSync = 0, lastTzCheck = 0;
struct { int32_t utcOffset; String name; bool autoDetected; } tz = {0, "UTC", true};
struct {
  String source = "ip-api.com";
  String status = "idle";
  String message = "not started";
  String responseSample = "";
  int httpCode = 0;
  unsigned long lastAttemptMs = 0;
  unsigned long lastSuccessMs = 0;
} tzDiag;

// OTA state
struct {
  bool inProgress = false;
  bool approved = false;
  bool lastSuccess = false;
  uint8_t lastErrorCode = 0;
  String lastErrorText = "";
  String lastFileName = "";
  uint32_t expectedBytes = 0;
  uint32_t writtenBytes = 0;
  unsigned long startedAt = 0;
  unsigned long finishedAt = 0;
} otaStatus;

// ============================================================================
// LED Functions
// ============================================================================

void setupLEDs() {
  if (ledStrip) delete ledStrip;
  ledStrip = new Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRBW + NEO_KHZ800);
  ledStrip->begin();
  ledStrip->setBrightness(ledBrightness);
  ledStrip->clear();
  ledStrip->show();
  Serial.println("[LED] 60-LED RGBW clock initialized");
}

void showLEDs() {
  if (!ledStrip) return;
  for (int i = 0; i < NUM_LEDS; i++) {
    ledStrip->setPixelColor(i, ledStrip->Color(leds[i].r, leds[i].g, leds[i].b, 0));
  }
  ledStrip->show();
}

void displayClock() {
  time_t now = time(nullptr);
  if (now < 86400) {
    // Not synced yet, show red at edges
    memset(leds, 0, sizeof(leds));
    leds[0] = {255, 0, 0};
    leds[NUM_LEDS-1] = {255, 0, 0};
    showLEDs();
    return;
  }
  
  struct tm* t = localtime(&now);
  uint8_t hour = t->tm_hour % 12;
  uint8_t min = t->tm_min;
  uint8_t sec = t->tm_sec;
  
  memset(leds, 0, sizeof(leds));
  
  if (min < NUM_LEDS) leds[min] = {0, 255, 0};  // Green minute
  
  // 3 red LEDs for hour (5 LEDs per hour: 0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55)
  int hpos = (hour * 5) % NUM_LEDS;
  for (int i = 0; i < 3; i++) {
    int pos = (hpos + i) % NUM_LEDS;
    uint8_t r = (uint16_t)leds[pos].r + 255; if (r > 255) r = 255;
    leds[pos] = {r, leds[pos].g, leds[pos].b};
  }
  
  // Blue second
  if (sec < NUM_LEDS) {
    uint8_t b = leds[sec].b + 255; if (b > 255) b = 255;
    leds[sec] = {leds[sec].r, leds[sec].g, b};
  }
  
  // Apply brightness
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i].r = (leds[i].r * ledBrightness) / 255;
    leds[i].g = (leds[i].g * ledBrightness) / 255;
    leds[i].b = (leds[i].b * ledBrightness) / 255;
  }
  
  showLEDs();
}

// ============================================================================
// EEPROM Functions
// ============================================================================

void loadEEPROMSettings() {
  EEPROM.begin(EEPROM_SIZE);
  uint8_t magic = EEPROM.read(EEPROM_MAGIC_ADDR);
  if (magic != EEPROM_MAGIC) {
    EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
    EEPROM.commit();
    Serial.println("[EEPROM] Initialized new settings");
    return;
  }
  
  // Load WiFi SSID
  String ssid = "";
  for (int i = 0; i < MAX_SSID_LEN; i++) {
    char c = EEPROM.read(EEPROM_SSID_ADDR + i);
    if (c == 0) break;
    ssid += c;
  }
  if (ssid.length() > 0) {
    String pass = "";
    for (int i = 0; i < MAX_PASS_LEN; i++) {
      char c = EEPROM.read(EEPROM_PASS_ADDR + i);
      if (c == 0) break;
      pass += c;
    }
    Serial.println("[EEPROM] Loaded WiFi: " + ssid);
    WiFi.begin(ssid.c_str(), pass.c_str());
  }
  
  // Load brightness
  uint8_t br = EEPROM.read(EEPROM_BRIGHTNESS_ADDR);
  if (br > 0 && br <= 255) ledBrightness = br;
  
  // Load timezone offset
  int32_t tzOff = (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 0) << 24) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 1) << 16) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 2) << 8) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 3));
  if (tzOff != 0 && tzOff >= -43200 && tzOff <= 43200) tz.utcOffset = tzOff;
}

void saveEEPROMSettings(const String& ssid, const String& pass) {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
  
  for (int i = 0; i < MAX_SSID_LEN; i++) {
    EEPROM.write(EEPROM_SSID_ADDR + i, i < ssid.length() ? ssid[i] : 0);
  }
  
